---
kind: type
id: T:Autodesk.Revit.Creation.AreaCreationData
source: html/3af826dc-5d69-f9b3-0b92-3a101cbfe7b2.htm
---
# Autodesk.Revit.Creation.AreaCreationData

A class which wraps the arguments of Area for batch creation

## Syntax (C#)
```csharp
public class AreaCreationData
```